{"scoring":null,"notes":"No primeiro caso, como não há ônibus apenas a condição de ``fizz'' é atendida.\n\nNo segundo exemplo, há veículos suficientes para o ``fizz'', mas não para o ``busao''.\n\nNo último exemplo, o décimo ônibus possibilita a o grito ``busao'', e a passagem do décimo quinto veículo permite que Jonnie finalmente solte seu urro.","legend":"Jonnie Ruquer gastava muito tempo no translado entre sua casa e a universidade, e decidiu criar um novo passatempo baseado em um de seus jogos favoritos. A cada veículo que passava, ele contava a frequência do tipo e gritava um descritor. Para toda terceira ocorrência de qualquer veículo, soltava ``fizz'' e a cada quinta ocorrência de um ônibus, era ``busao''. A diversão era plena quando estas condições coincidiam, e ele urrava ``fizzbusao''. Nos demais casos, ele simplesmente dizia a quantidade de veículos e torcia pelo próximo grito. \n\nPara verificar se ele está seguindo as regras, crie um programa que, dada uma sequência de veículos, imprima a sequência de descritores conforme as regras dadas.","authorLogin":"gnramos","language":"english","timeLimit":1000,"output":"A saída deve ser composta por $N$ linhas, cada uma apresentando o descritor da situação de cada veículo na mesma ordem em que são dados.","inputFile":"stdin","outputFile":"stdout","input":"A entrada consiste de uma linha contendo $N$ ($1 \\leq N \\leq 1000$) caracteres contíguos, no alfabeto $\\{C, O\\}$, indicando a ocorrência de um carro ou de um ônibus, respectivamente.","authorName":"Guilherme Ramos","sampleTests":[{"output":"1\n2\nfizz\n4\n5\n","input":"CCCCC\n","inputFile":"example.01","outputFile":"example.01.a"},{"output":"1\n2\nfizz\n4\n","input":"COCO\n","inputFile":"example.02","outputFile":"example.02.a"},{"output":"1\n2\nfizz\n4\nbusao\nfizz\n7\n8\nfizz\n10\n11\nfizz\n13\n14\nfizzbusao\n","input":"OOOOOCCCCCOOOOO\n","inputFile":"example.03","outputFile":"example.03.a"}],"name":"Fizz Busão","interaction":null,"memoryLimit":268435456,"tutorial":"A solução envolve dois contadores, um para veículos e outro para ônibus, que são incrementados conforme a entrada. Toda vez que o contador de ônibus é múltiplo de 5, Jonnie Ruquer pode dizer ``busao''. Toda vez que o contador de veículos é múltiplo de 3, ele pode dizer ``fizz'', inclusive quando também puder dizer ``busao''. Nos demais casos, é só mostrar o contador de veículos."}
